"use client";

import React, { useState } from "react";
import "./page.css";
import GrampanchayatHeader from "../Components/Header/GrampanchayatHeader";
import GrampanchayatFooter from "../Components/Footer/GrampanchayatFooter";

export default function VikasPage() {
  const developmentData = [
    {
      title: "पाणीपुरवठा योजना सुधारणा",
      items: [
        "गावातील पाण्याची समस्या सोडवण्यासाठी नवीन नळ लाईन आणि टाकी दुरुस्तीचे काम पूर्ण.",
      ],
    },
    {
      title: "ग्रामपंचायत इमारत देखभाल",
      items: ["ग्रामपंचायत कार्यालयाचे नूतनीकरण, रंगकाम, वीजयोजना अपग्रेडेशन."],
    },
    {
      title: "LED स्ट्रीट लाइट बसविणे",
      items: ["पर्यावरणपूरक LED लाईट्स बसवून ऊर्जा बचत वाढवली."],
    },
    {
      title: "जलसंधारण कामे",
      items: [
        "पाणी आडवा-पाणी जिरवा अंतर्गत बंधारे, नालेसफाई, गाळकाढणीची कामे.",
      ],
    },
    {
      title: "स्वच्छता अभियान",
      items: [
        "स्वच्छ भारत मिशन अंतर्गत सार्वजनिक ठिकाणांची स्वच्छता व जागरूकता मोहीम.",
      ],
    },
    {
      title: "सुरू असलेली विकासकामे",
      items: ["नाली बांधकाम", "नाली सफाई"],
    },
    {
      title: "वार्षिक विकास आराखडा",
      items: [
        "ग्रामपंचायत वार्षिक विकास आराखडा सार्वजनिक नियोजनानुसार राबविण्यात येत आहे.",
      ],
    },
    {
      title: "नागरिक सेवा",
      items: ["जन्म नोंद दाखला", "मृत्यू नोंद दाखला", "विवाह नोंद दाखला"],
    },
    {
      title: "गावातील मूलभूत सुविधा",
      items: [
        "लोकसंख्या: 1975",
        "शाळा: 02",
        "आरोग्य केंद्र: 01",
        "अंगणवाडी: 02",
      ],
    },
    {
      title: "इतर महत्वाची माहिती",
      items: [
        " पूर्ण गावाला आरो पाणी मोफत उपलब्ध केले",
        "तलाव खोलीकरण व तलाव सफाई",
      ],
    },
    {
      title: "विविध शासकीय योजना",
      items: [
        "मुख्यमंत्री लाडकी बहिण योजना",
        "प्रधानमंत्री आवास योजना",
        "आयुष्मान भारत कार्ड योजना",
        " वयोश्री योजना",
        "श्रम कार्ड योजना",
      ],
    },
  ];

  return (
    <>
      <div>
        <GrampanchayatHeader />

        <div className="development-container">
          <h2 className="page-title">
            🧰 विकास कामे <span>(Development Works)</span>
          </h2>

          <div className="card-grid">
            {developmentData.map((section, index) => (
              <div className="info-card" key={index}>
                <div className="card-header">
                  <span className="check-icon">✔</span>
                  <h3>{section.title}</h3>
                </div>

                <ul>
                  {section.items.map((item, i) => (
                    <li key={i}>• {item}</li>
                  ))}
                </ul>

                <div className="card-footer">📅 वर्ष : 2024-25</div>
              </div>
            ))}
          </div>
        </div>

        <GrampanchayatFooter/>
      </div>
    </>
  );
}
